using DAL.Entities;
using System;
using System.Linq;

namespace DAL.Data
{
    public static class DbInitializer
    {
        public static void Initialize(BookSearchContext context)
        {
            context.Database.EnsureCreated();

            if (context.Books.Any())
            {
                return;
            }
            var books = new Book[]
                {
                    new Book{ Title = "Алхимик", Author = new Author { Full_name="Пауло Коэльо"}, Description = "«Алхи́мик» (порт. O Alquimista) — роман Пауло Коэльо, изданный в 1988 году и ставший мировым бестселлером. Издан более чем в 117 странах мира, переведён на 81 язык. Основной сюжет взят из европейского фольклора: по классификации фольклорных сюжетов Аарне - Томпсона - Утера — сюжет 1645 «Сокровище дома» . Типичный представитель — английская сказка «The Pedlar of Swaffham» («Сон коробейника»), а также один из эпизодов «Тысячи и одной ночи». Было выпущено более 145 тыс.книг.",
                    Publication_date = new DateTime (1988) },
                    new Book{ Title = "Книжный вор", Author = new Author { Full_name="Маркус Зусак"}, Description = "«Книжный вор» (англ. The Book Thief) — роман австралийского писателя Маркуса Зусака, написанный в 2005 году. Находился в списке «The New York Times Best Seller list» более 230 недель. Экранизирован в 2013 году режиссёром Брайаном Персивалем. В российском прокате фильм, роль Лизель в котором исполнила 13-летняя Софи Нелисс, демонстрировался под более корректным названием «Воровка книг».",
                    Publication_date = new DateTime (2005) }
                 };
            foreach (Book b in books)
            {
                context.Books.Add(b);
            }
            context.SaveChanges();

            var comments = new Comment[]
                {
                     new Comment { BookID = 1, Title = "Кто слишком часто оглядывается назад, легко может споткнуться и упасть",
                     Date_of_creation = new DateTime (20/09/2020),Content = " Эмигранты. Люди покинувшие свою страну. Некоторые по доброй воле, а многие были вынуждены это сделать. Нужны ли они другой стране? Даже если ты профи в своем деле, но у тебя нет документов, ты никто. Так и жили люди на птичьих правах без Родины, без флага. Жили, не зная, что будет завтра. Жили постоянно прячась. Разве это жизнь? Сильные духом находили выход, слабые терпели, но и бойцов часто покидали силы. Книги Ремарка плотные и тяжелые. Приступая к каждому произведению, знаешь, легко не будет. Каждая страница сокращает путь к твоим эмоциям и психологически готовит место к душевному взрыву. Так же произошло и в этот раз. На протяжении всей книги было безэмоциональное восприятие. Я решила, что хоть одна книга не тянет на пятерку. Наступила развязка, которая привела меня в ступор. Я не ревела, но была на грани. На тот момент пришло осознание всего сюжета и стало стыдно за свое осуждение героев (он тряпка, она шалава). Меня переполняют эмоции, и выразить все по горячим следам тяжело. Ремарк достойный писатель!"}

                };
            foreach (Comment c in comments)
            {
                context.Comments.Add(c);
            }
            context.SaveChanges();

            var genres = new Genre[]
                {
                    new Genre { NameGenre = "Роман"},
                    new Genre { NameGenre = "Комедия"},
                    new Genre { NameGenre = "Детектив"},
                    new Genre { NameGenre = "Рассказ"},
                    new Genre { NameGenre = "Повесть"}
                };

            foreach (Genre g in genres)
            {
                context.Genres.Add(g);
            }
            context.SaveChanges();

        }
    }
}
